
import jieba

water_keywords = [
    "漏水","滴水","水位","水",
    "堵塞","塞","水压","水垢","水槽","喷头","水帘","喷淋","喷淋","淋浴","水柱","排水","抽水",
    "疏通","滤","阀门","湿","浴","浴缸","水盆","水锈","污水","流",
    "水流","水塔","水带","水温","水质","水滤器","供水","热水器","供冷","过滤","沉淀物",
    "淤泥","沙粒","气泡","浑浊","污","出水","进水","抽"
]

water_main_keywords = [
    "水管","水龙头","水泵","水池","水阀","水表","马桶","水箱","水槽","花洒","厕所","下水道","洗手间","浴室"
]

electric_keyword = [
    "电","断路","变压","接触","继电","配电","电压","电池","开关",
    "熔断","稳压","整流","电阻","电容","发电机",
    "电源","电机","电子","电线短路","电流过载","电力","电气",
    "电磁干扰","电源中断","电网","电压超标","电桩","充电","断电","供电",
    "高压","低压","开路","电容","电感","电源",
    "负载","导线","连接","接头","电子","电感","电路板","连接","网络","无线"
]

electric_main_keyword = [
    "没电","电线","电缆","电力","电流","插头","插座","电箱","电表","漏电","电路","短路","电闸","跳电","停电","网"
]

mechanical_keyword = [
    "保养","发动机",
    "齿轮","皮带","链条","润滑","温控器","传感器","控制器",
    "显示器","开关","按钮","震动","噪声","部件","组件","零件","故障","警告灯",
    "停机","启动","运行","性能","效率","速度","动力","响应","控制",
    "漏油","漏气","烧毁","爆炸","冒烟","变形","磨损","断裂","裂纹","撕裂","塌陷","腐蚀",
    "塞住","堵塞","卡住","硬化","软化","干燥","湿润","过热","引擎",
    "停转","转速","过快","松动","损坏","断","松","磨",
    "动","失灵","接触不良","关闭","开启","按","弹"
]

mechanical_main_keyword = [
    "器","机","电器","设备","机械","空调","冰箱","烤箱","微波炉","电梯","马达","水饮机","调节器","暖器","热水器","灯","冷气"
]

stopwords = ["啊","哎","唉","俺","按","吧","把","甭","别","嘿","很","乎","会","或","既","及","啦","了","们","你","您","哦","砰","啊","你","我","他","她","它",'的','是', '在', '和','请',"一直","(",")",":","?"]


# def auto_assign(text):
#     tokens = jieba.cut(text)  # 使用jieba分词器对文本进行分词
#     #filtered_tokens = [token for token in tokens if token not in stopwords]

#     data={}
#     data['0'] = 0
#     data['1'] = 0
#     data['2'] = 0
#     data['3'] = 0

#     for word in tokens:
#         if word not in stopwords:
#             if any(item in word for item in water_keywords):
#                 data['1'] += 1
#                 print("水关键词出现")
#             if any(item in word for item in electric_keyword):
#                 data['2'] += 1
#                 print("电关键词出现")
#             if any(item in word for item in mechanical_keyword):
#                 data['3'] += 1
#                 print("机械关键词出现")

#     type_list = sorted(data.items(), key=lambda x: (-x[1], x[0]))
#     print(type_list)

#     return type_list[0][0]
    
# print(auto_assign("房间有异味,马桶抽不了水"))
