
import jieba

water_keywords = [
    "漏水","滴水","水管","水龙头","水泵","水位","排水","水池","水阀","水表","水","水位","水池","马桶",
    "堵塞","塞","水压","水表","水垢","水箱","水槽","喷头","水帘","喷淋","喷淋","淋浴","水柱","排水","抽水",
    "疏通","厕所","滤","阀门","下水道","湿","浴","浴缸","水盆","淹","浸","水锈","污水","流",
    "水流","水塔","水带","水温","水质","水滤器","供水","热水器","供冷","洗手间","浴室","过滤","沉淀物",
    "淤泥","沙粒","气泡","浑浊","污","出水","进水"
]

electric_keyword = [
    "电","没电","断路","变压器","接触器","继电器","配电盘","电线","电缆","电压","电流","电池","开关","电力"
    "插头","插座","熔断器","稳压器","整流器","电阻","电容器","晶体管","二极管","发电机",
    "电源","电机","电子系统","电线短路","电流过载","电力故障","电气火灾",
    "电磁干扰","电源中断","电网稳定性","电压骤降","电压超标","电气设备维护","电气设备检修",
    "电气设备保养","电气设备安装","电网","电桩","充电器","断电","供电","单相电","三相电",
    "直流电","交流电","蓄电池","电流表","电压表","电阻表","示波器","示波表","钳形电流表",
    "绝缘电阻表","接地电阻表","电表","漏电保护器","漏电开关","漏电断路器","漏电继电器",
    "高压断路器","低压断路器","空气断路器","真空断路器","SF6断路器","油浸断路器",
    "气体断路器","电气","电路","短路","开路","接地","电流","电容","电感","电源",
    "负载","导线","绝缘","连接","接头","电子元件","半导体","二极管","三极管","晶体管",
    "集成电路","微处理器","电阻器","电感器","变压器","稳压器","开关","电闸","电路板"
    "连接","网","网络","无线","跳电","停电"
]

mechanical_keyword = [
    "电器","设备","机械","维修","保养","检查","检修","更换","安装","故障","异常",
    "问题","调试","调整","整修","电机","发动机","电热器","空调","冰箱","洗衣机","烤箱",
    "微波炉","电梯","熔丝","轴承","齿轮","皮带","链条","润滑","温控器","传感器","控制器",
    "显示器","开关","按钮","震动","噪声","部件","组件","零件","故障代码","错误提示","警告灯",
    "停机","无法启动","运行异常","性能下降","效率降低","速度减慢","动力不足","响应迟钝","控制失灵",
    "漏油","漏气","烧毁","爆炸","冒烟","变形","磨损","断裂","裂纹","撕裂","塌陷","腐蚀","污染",
    "塞住","堵塞","卡住","硬化","软化","干燥","湿润","热变性","冷变性","线圈烧坏","马达过热",
    "马达震动","马达噪声","马达停转","马达转速过快","马达转速过慢","齿轮损坏","齿轮磨损","齿轮噪声",
    "齿轮松动","轴承损坏","轴承磨损","轴承噪声","轴承过热","皮带断裂","皮带松弛","皮带磨损",
    "皮带滑动","链条断裂","链条松弛","链条磨损","链条滑动","温控器失灵","温控器不准","温控器损坏",
    "传感器失灵","传感器不准","传感器损坏","控制器失灵","控制器不准","控制器损坏","显示器显示不清",
    "显示器显示错误","显示器无显示","显示器损坏","开关接触不良","开关无法关闭","开关无法开启",
    "开关损坏","按钮无法按下","按钮无法弹起","按钮损坏","连接器接触不良","连接器无法连接","连接器无法断开","连接器损坏","端子接触不良","端子无法连接","端子无法断开","端子损坏","热水器","器","机",
    "水饮机","设备","传感器","调节器","暖器","马达"
]

stopwords = ["啊","哎","唉","俺","按","吧","把","甭","别","嘿","很","乎","会","或","既","及","啦","了","们","你","您","哦","砰","啊","你","我","他","她","它",'的','是', '在', '和','请',"一直","(",")",":","?"]

'''
def auto_assign(text):
    tokens = jieba.cut(text)  # 使用jieba分词器对文本进行分词
    #filtered_tokens = [token for token in tokens if token not in stopwords]

    """
    print(filtered_tokens)
    data={}
    data['1'] = 0
    data['2'] = 0
    data['3'] = 0
    """ 

    for word in tokens:
        if any(word in item for item in water_keywords):
            print("字符串在水关键词里面")
        if any(word in item for item in electric_keyword):
            print("字符串在电关键词里面")
        if any(word in item for item in mechanical_keyword):
            print("字符串在机械关键词里面")

    """
    for token in filtered_tokens:
        if token in water_keywords:
            data['1'] += 1
        if token in electric_keyword:
            data['2'] += 1
        if token in mechanical_keyword:
            data['3'] += 1
    """

    #type_list = sorted(data.items(), key = lambda kv:(kv[0], kv[1]))
    #print(type_list)

    #return type_list[0][0]
    
print(auto_assign("电线接触不良"))
'''